Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

01:00:44.231 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/_E9XNIDM_Ju6eYGoX4W82ef20E8/TU8qy_l105tS7d11heKc5273jwU
01:00:44.257 INFO   tofu: Initializing the backend...
01:00:44.543 INFO   tofu: Initializing provider plugins...
01:00:44.543 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:44.733 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:44.904 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:00:45.015 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:00:45.119 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:45.239 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:00:45.345 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:00:45.465 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:00:45.803 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:00:45.824 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:00:45.836 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:00:45.871 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:00:45.907 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:00:45.929 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.8.1
01:00:45.965 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:00:45.981 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:00:45.982 INFO   tofu: OpenTofu has been successfully initialized!
01:00:46.643 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:00:46.644 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:00:46.644 STDOUT tofu:   ~ update in-place
01:00:46.644 STDOUT tofu: OpenTofu will perform the following actions:
01:00:46.644 STDOUT tofu:   # helm_release.renovate will be updated in-place
01:00:46.644 STDOUT tofu:   ~ resource "helm_release" "renovate" {
01:00:46.644 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
01:00:46.644 STDOUT tofu:       ~ metadata                   = {
01:00:46.644 STDOUT tofu:           ~ app_version    = "42.42.1" -> (known after apply)
01:00:46.644 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
01:00:46.644 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
01:00:46.644 STDOUT tofu:           ~ last_deployed  = 1765383030 -> (known after apply)
01:00:46.644 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
01:00:46.644 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
01:00:46.644 STDOUT tofu:           ~ revision       = 57 -> (known after apply)
01:00:46.644 STDOUT tofu:           ~ values         = jsonencode(
01:00:46.644 STDOUT tofu:                 {
01:00:46.644 STDOUT tofu:                   - envFrom  = [
01:00:46.644 STDOUT tofu:                       - {
01:00:46.644 STDOUT tofu:                           - secretRef = {
01:00:46.644 STDOUT tofu:                               - name = "renovate-env"
01:00:46.644 STDOUT tofu:                             }
01:00:46.644 STDOUT tofu:                         },
01:00:46.644 STDOUT tofu:                     ]
01:00:46.644 STDOUT tofu:                   - renovate = {
01:00:46.644 STDOUT tofu:                       - config = jsonencode(
01:00:46.644 STDOUT tofu:                             {
01:00:46.644 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
01:00:46.644 STDOUT tofu:                               - platform     = "github"
01:00:46.644 STDOUT tofu:                               - repositories = [
01:00:46.644 STDOUT tofu:                                   - "youhide/hideForming",
01:00:46.644 STDOUT tofu:                                 ]
01:00:46.644 STDOUT tofu:                             }
01:00:46.644 STDOUT tofu:                         )
01:00:46.644 STDOUT tofu:                     }
01:00:46.644 STDOUT tofu:                 }
01:00:46.644 STDOUT tofu:             ) -> (known after apply)
01:00:46.644 STDOUT tofu:           ~ version        = "45.38.1" -> (known after apply)
01:00:46.644 STDOUT tofu:         } -> (known after apply)
01:00:46.644 STDOUT tofu:         name                       = "renovate"
01:00:46.644 STDOUT tofu:       ~ version                    = "45.38.1" -> "45.47.3"
01:00:46.644 STDOUT tofu:         # (26 unchanged attributes hidden)
01:00:46.644 STDOUT tofu:     }
01:00:46.644 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:00:46.644 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```